path = 'DataBase'
name = 'company.db'
workers = 20

columns_workers = ['workers_id', 'first_name', 'last_name', 'birth_day', 'phone']
columns_position = ['position_id', 'position', 'salary']
columns_work_position = ['workers_id', 'position_id', 'hire_date']

positions = ['Директор', 'Геолог', 'Геофизик', 'Гидрогеолог', 'Геодезист', 'Маркшейдер', 'Картограф',
             'Топограф', 'Методист']

first_name = ['Андрей', 'Андроник', 'Аннерс', 'Анри', 'Ансельм', 'Антипа', 'Антон', 'Варнава',
              'Варфоломей', 'Василий', 'Вахтанг', 'Велвел', 'Венансио', 'Григорий', 'Георгий', 'Гераклид', 'Нестор',
              'Никандр', 'Никанор', 'Никита']

last_name = ['Безделкин', 'Безденежный', 'Безденежных', 'Бездонов', 'Белевцев', 'Белей', 'Беленко', 'Беленков',
             'Беленький', 'Белехов', 'Гранев', 'Гранкин', 'Гранков', 'Живоглотов', 'Живоедов', 'Капцов',
             'Карабанов', 'Карабейников', 'Карабельщиков', 'Караваев']
